Repository: NIKHIL314959/Master-Thesis-on-IGUS-RL-DP-5
Catalog: AutomationStudio/Logical/mappView/Resources/Texts/TextSys.tmx
Source language: en
Languages: de

source: Velocity axis 1:
de: Geschwindigkeit Achse 1:

source: Velocity axis 2:
de: Geschwindigkeit Achse 2:

source: Velocity axis 3:
de: Geschwindigkeit Achse 3:

source: Velocity axis 4:
de: Geschwindigkeit Achse 4:

source: Velocity axis 5:
de: Geschwindigkeit Achse 5:

source: Properties
de: Eigenschaften

source: Move robot
de: Bewegungen Roboter

source: Change the G-Code
de: Veränderungen am G Code

source: Load file
de: Lade Datei

source: Save file
de: Speichere Datei

source: Refresh table
de: Table aktualisieren

source: Start program
de: Start Programm

source: Outputs
de: Ausgänge

source: Welcome
de: Willkommen

source: This visualization is controlling the IGUS robot.
de: Diese Visualizierung kontrolliert den IGUS Roboter.

source: Current state:
de: Zustand:

source: Programs
de: Programme

source: Velocity direction X:
de: Geschwindigkeit Richtung X:

source: Velocity direction Y:
de: Geschwindigkeit Richtung Y:

source: Velocity direction Z:
de: Geschwindigkeit Richtung Z:

source: Velocity angle B:
de: Geschwindigkeit Winkel B:

source: Velocity direction C:
de: Geschwindigkeit Winkel C:

source: Value axis:
de: Wert Achsen:

source: Velocity:
de: Geschwindigkeit:

source: Degree axis 1:
de: Winkel Achse 1:

source: Degree axis 2:
de: Winkel Achse 2:

source: Degree axis 3:
de: Winkel Achse 3:

source: Degree axis 4:
de: Winkel Achse 4:

source: Degree axis 5:
de: Winkel Achse 5:

source: Acceleration:
de: Beschleunigung:

source: Deceleration:
de: Verlangsamerung:

source: The home position is for every angle equal to zero.
de: Die Winkel aller Achsen sind in der Startposition Null.

source: Program monitor
de: Programm Monitor

source: Current program:
de: Aktuelles Programm:

source: Set default setting values
de: Standardwerte in Einstellungen setzen

source: Settings
de: Einstellungen

source: Set current position as input
de: Setzt derzeitige Position als Input

source: E-Stop has been pressed
de: E-Stop wurde betätigt

source: Current path velocity:
de: Derzeitige Bahngeschwindigkeit:

source: Programmed path velocity:
de: Programmierte Bahngeschwindigkeit:

source: Remaining distance:
de: Verbleibende Strecke:

source: Set default position values
de: Standardwerte als Position setzen

source: Power On
de: Power An

source: Interrupt
de: Unterbrechen

source: General
de: Allgemein

source: Automatic mode
de: Automatischer Modus

source: Manual mode ACS
de: Manueller Modus ACS

source: Manual mode MCS
de: Manueller Modus MCS

source: Powered
de: Bestromt

source: Homed
de: Referenziert

source: Command is executed
de: Kommando wird ausgeführt

source: In motion
de: In Bewegung

source: Stopped
de: Gestopped

source: Move interrupted
de: Bewegung unterbrochen

source: Message
de: Nachricht

source: Acknowledge
de: Bestätigen

source: Acknowledge all
de: Alles bestätigen

source: Timestamp
de: Zeitpunkt

source: State
de: Status

source: Move linear
de: Lineare Bewegung

source: Move direct
de: Direkte Bewegung

source: Line number:
de: Linien Nummer:

source: Block number:
de: Block Nummer:

source: Second last:
de: Vorletzte:

source: Last:
de: Letzte:

source: Current:
de: Aktuell:

source: Next:
de: Nächste:

source: Second next:
de: Übernächste:

source: Current file
de: Aktuelle Datei

source: Selection of the current file
de: Auswahl der aktuellen Datei

source: Teached files
de: Gelernte Dateien

source: Selection of the used point (marked on the left table):
de: Auswahl des Punktes (markiert in der linken Tabelle):

source: Delete point
de: Lösche Punkt

source: Change
de: Ändern

source: Move current teachfile
de: Fahre die aktuelle Datei

source: Save teached points
de: Speichern der gelernten Punkte

source: Name of the new file:
de: Name der neuen Datei:

source: Drive back to homeposition after the movement?
de: Zurück zur Homeposition nach der Bewegung?

source: Teach point
de: Speicher Punkt

source: Choose axis by clicking on it
de: Selektieren Sie eine Achse

source: Positive
de: Positiv

source: Negative
de: Negativ

source: Movement direction of coordinate X
de: Bewegungsrichtung der X Koordinate

source: Movement direction of coordinate Y
de: Bewegungsrichtung der Y Koordinate

source: Movement direction of coordinate Z
de: Bewegungsrichtung der Z Koordinate

source: Movement direction of coordinate B
de: Bewegungsrichtung der B Koordinate

source: Movement direction of coordinate C
de: Bewegungsrichtung der C Koordinate
